app/Models/V1/Mdl_kategori.php

    public function add($mdata)
    {
        try {
            $kategori = $this->db->table("kategori");

            // Insert data into 'kategori' table
            if (!$kategori->insert($mdata)) {
---
INSERT INTO `kategori` (`namakategori`, `created_at`) VALUES ('Dry Food', '2024-10-12 03:43:44')