app/Models/V1/Mdl_pengguna.php

    public function add($mdata)
    {
        try {
            $pengguna = $this->db->table("pengguna");

            // Insert data into 'pengguna' table
            if (!$pengguna->insert($mdata)) {
---
INSERT INTO `pengguna` (`username`, `password`, `role`, `status`, `created_at`) VALUES ('kasir', '123', 'kasir', 'active', '2024-10-16 04:02:55')