app/Models/V1/Mdl_barang.php

UPDATE `barang` SET `namabarang` = 'Snack Pilihan Kami', `id_kategori` = '1', `id_satuan` = '1', `stokmin` = '10', `update_at` = '2024-10-16 06:04:31'
WHERE `id` = '3'
INSERT INTO `harga` (`id_barang`, `tanggal`, `harga1`, `harga2`, `harga3`, `disc_pct`, `disc_fxd`) VALUES ('3', '2024-10-16 06:04:31', '100000', '12000', '12500', '0.001', '5000')
---
    public function ubah($mdata,$mharga,$id)
    {
        try {
            $barang = $this->db->table("barang");
            $harga = $this->db->table("harga");

            $barang->where("id", $id);

            // Attempt to update the record
            if (!$barang->update($mdata)) {
                return (object) array(
                    "code"      => 400,
                    "message"   => "Gagal mengubah barang"
                );
            }
            $harga->insert($mharga);