app/Models/V1/Mdl_sales.php

    public function add($mdata)
    {
        try {
            $sales = $this->db->table("sales");

            // Insert data into 'sales' table
            if (!$sales->insert($mdata)) {
---
INSERT INTO `sales` (`namasales`, `alamat`, `kota`, `telp`, `omzet`, `created_at`) VALUES ('ardi', 'Mengwi', 'Badung', '0811111111111', '100000', '2024-10-12 05:26:29')

    public function ubah($mdata, $id)
    {
        try {
            $sales = $this->db->table("sales");
            $sales->where("id", $id);

            // Attempt to update the record
            if (!$sales->update($mdata)) {
---
UPDATE `sales` SET `namasales` = 'Agus Santoso', `alamat` = 'Jl HOS cokroaminoto 10', `kota` = 'Badung Selatan', `telp` = '082555220', `omzet` = '100000000', `update_at` = '2024-09-13 12:35:36'
WHERE `id` = '2'